{
    "job_description": [
      {
        "rqf_id": "RFQ001",
        "title": "Test Engineer",
        "type": "Labour Hire",
        "status": "Open",
        "industry": "Software Development",
        "buyer": "ABC Buyer",
        "country": "Australia",
        "location": "Canberra, Melbourne, Brisbane",
        "residency": "Citizen",
        "arrangement": "Onsite",
        "content": "Test Engineers ensure that their test effort is effectively executed and that allocated activities are completed in a structured, consistent manner in accordance with agreed test guidelines. Test Engineers use their in-depth knowledge to provide technical advice and development to less experienced testers. Test Engineers work under the general direction and support of senior staff. They exercise a degree of independent judgement and make decisions within defined parameters that require reliance on skills and knowledge. They plan their own work and contribute to team work goals in the context of competing priorities, and changes in workplace practices and business improvement strategies.  Estimated start date  6 January 2025 Initial contract duration 12 months Extension term 12 months Number of extensions 2 Location of work ACT, QLD, VIC Security clearance Must be an Australian Citizen and able to obtain a Baseline Security Clearance  Key duties may include, but are not limited to: • Execute assigned test cases at various stages of testing on appropriate testing platforms • Develop test plans, test cases, task cards, and supporting test data and/or requirements, under own direction from the specifications provided • Analyse and report on test activities and results, and escalate issues and risks to senior staff • Contribute to team improvement initiatives and projects, including team tools, process changes, and test automation • Identify, manage and document defects, programming errors and operational characteristics that are inconsistent with stated requirements and design specifications • Conduct testing to ensure the ICT service functions as per requirements • Create test data within external software vendor environment • Accurately record time and effort for test cases • Allocate work to team members, using judgement to match issue complexity and staff capability • Provide assistance and training to less experienced testers • Support team to follow business processes and align to overall delivery outcomes • Maintain up-to-date knowledge of ICT related legislation, policy and processes and transfer knowledge to other team members • Collaborate with stakeholders to ensure effective and timely implementation of projects • Provide advice and assistance to external software vendors in regards to testing and development of software • Assist with cost analysis activities as required • Exercise appropriate delegations in accordance with legislation and guidelines.  Primary Knowledge/Skills/Systems/Tools required for role include: • Experience with SAP CRM Weighted Criteria • The Candidate’s employment history, prior experience in undertaking the same or similar role for an organisation of the same or similar size and complexity as Services Australia. •The Candidate’s professional qualifications, relevant to the position being applied for. •The Candidate’s professional accreditations, if applicable to the position being applied for. • The Candidate’s skills relevant to the position being applied for. •The response describing how the Candidate’s skills, knowledge, experience and qualifications would contribute to the position being applied for."
      },
      {
        "rqf_id": "RFQ002",
        "title": "Project M",
        "type": "Labour Hire",
        "status": "Open",
        "industry": "Software Development",
        "buyer": "Test Buyer",
        "country": "Australia",
        "location": "Canberra",
        "residency": "Citizen",
        "arrangement": "Hybrid",
        "content": "Reporting to the Director - IT Projects, CIO and project boards, these roles will be responsible for implementation of COTS and bespoke applications. The Project Manager will work with other IT resources including business analysts, solution architects, solution designers, testers, developers and other resources as required.  The duties will include, but are not limited to: Scoping, planning, implementing and reporting on assigned projects to agreed standards and tolerances Tasking/managing project resources and coordinating with business SME's, service providers and stakeholders to meet project outcomes Development of project management documentation, including business cases, project plans, project reports, transition plans, schedules, registers, closure reports and post implementation reviews Management of project risks, escalation and resolution of issues Working with stakeholders supporting project procurement activities - workshops, reviews, creation of documentation, including RFQs/Tenders, evaluation reports Establishment and maintenance of working relationships with stakeholders and executive sponsors Guiding project related change including providing clear, consistent communication with active engagement Contribution to continuous project management improvement activities across IT and AMSA  Estimated start date 13 January 2025 Initial contract duration 12 months Extension term 12 months Number of extensions 2 Location of work ACT Working arrangements AMSA National Office and the project teams, including this role are mostly CANBERRA based. Australian interstate or regional candidates may be considered but should factor in the requirement to attend on site as required/directed at their own cost. AMSA will consider hybrid work arrangements i.e. work from home (WFH), however this may be periodically reviewed based on performance. Instances where WFH is found to be ineffective may result in change to WFH arrangements or other actions as appropriate. Security clearance Other - Police Check MUST be provided (if shortlisted as suitable) by the recruitment agency before contract will be issued."
      },    
      {
        "rqf_id": "RFQ003",
        "title": "Business Analyst",
        "type": "Labour Hire",
        "status": "Open",
        "industry": "Information Technology",
        "buyer": "DEF Buyer",
        "country": "Global",
        "location": "Canberra",
        "residency": "N/A",
        "arrangement": "Remote",
        "content": "The client is seeking to identify suitable Candidates to perform the role of Business Analysts, Systems Analysts and Solution Design Managers up to manager levels to support  the agency to document business requirements, capture business needs, and design, create, evaluate, and document ICT solutions in new and existing ICT systems.   Business Analysts analyse and integrate information provided by customers, staff, Information Technology (IT) professionals, executives, and other internal and external  stakeholders. They are responsible for understanding the core needs and requirements of stakeholders and the agency. Business Analysts often play a central role in aligning the  needs of business units with the capabilities delivered by IT or business activities and may serve as a translator between stakeholder groups. Business Analysts exercise a degree of  independent judgement and make decisions within defined parameters that rely on skills and knowledge. "
      },    
      {
        "rqf_id": "RFQ004",
        "title": "Accountant",
        "type": "Permanent",
        "status": "Open",
        "industry": "Accounting & Finance Services",
        "buyer": "Test Buyer",
        "country": "Australia",
        "location": "Melbourne, Sydney, Canberra, Brisbane",
        "residency": "Citizen",
        "arrangement": "Onsite",
        "content": "Job Summary: The Accountant will play a key role in maintaining the financial health of the organisation by managing reporting, compliance, and taxation requirements. You will collaborate with stakeholders to provide strategic financial insights and ensure adherence to Australian accounting standards. Key Responsibilities: Prepare and analyse financial statements, budgets, and forecasts. Manage month-end and year-end reporting processes in compliance with Australian Accounting Standards (AASB). Oversee accounts payable, receivable, payroll, and general ledger activities. Ensure timely and accurate completion of BAS (Business Activity Statements), GST reporting, and tax compliance. Provide strategic financial advice to support decision-making. Perform reconciliations (bank, inventory, credit cards, etc.). Liaise with auditors, tax consultants, and external stakeholders. Utilise accounting systems like Xero, MYOB, SAP, or equivalent. Develop and improve internal financial processes to enhance efficiency.  Key Requirements: Bachelor’s degree in Accounting, Finance, or a related field. CPA or CA accreditation (or working towards it). Minimum 3+ years of accounting experience in Australia. Proficiency in accounting software (Xero, MYOB, QuickBooks, or SAP). Knowledge of Australian Taxation Office (ATO) regulations and Fair Work legislation. Strong analytical and problem-solving skills. Excellent communication and stakeholder management skills.  Competencies: Attention to detail and accuracy. Ability to work independently and meet deadlines. Strong organisational and time management skills."
      },    
      {
        "rqf_id": "RFQ005",
        "title": "IT Support Engineer",
        "type": "Permanent",
        "status": "Open",
        "industry": "IT Support Engineer",
        "buyer": "Test Buyer",
        "country": "United States of America",
        "location": "Arlington Heights",
        "residency": "Citizen",
        "arrangement": "Onsite",
        "content": "Job Summary: The IT Support Engineer will provide technical support and troubleshooting to end users, ensuring smooth operation of hardware, software, and networks. You will respond to support requests, perform system maintenance, and assist with IT infrastructure projects. Key Responsibilities: Troubleshoot hardware, software, and network issues, providing Level 1/2 IT support. Respond to helpdesk tickets and provide timely resolutions. Install, configure, and maintain Windows, macOS, and Linux systems. Manage user accounts and permissions using Active Directory and Office 365. Support networking hardware (routers, switches, firewalls) and resolve connectivity issues. Set up and maintain peripherals such as printers, scanners, and mobile devices. Document support processes and update technical documentation. Assist in IT infrastructure upgrades and projects (e.g., cloud migrations). Monitor IT systems and identify potential issues proactively.  Key Requirements: Certificate IV or higher in Information Technology, Networking, or related discipline. Minimum 2+ years experience in IT support roles in Australia. Strong knowledge of Windows Server, Office 365, Active Directory, and networking protocols. Familiarity with ITIL processes and helpdesk ticketing systems (e.g., ServiceNow, Zendesk). Experience with troubleshooting laptops, desktops, and mobile devices. Understanding of cybersecurity fundamentals and best practices. Ability to explain technical solutions to non-technical users.  Competencies: Strong customer service skills and a problem-solving mindset. Ability to work independently and under pressure. Excellent verbal and written communication skills."
      },
      {
        "rqf_id": "RFQ006",
        "title": "Software Developer",
        "type": "Permanent",
        "status": "Open",
        "industry": "Software Development",
        "buyer": "GHI Buyer",
        "country": "Australia",
        "location": "Adelaide",
        "residency": "Citizen",
        "arrangement": "Onsite",
        "content": "Job Summary: The Software Developer will design, develop, and maintain software solutions that align with business requirements. You will collaborate closely with the development team, product owners, and stakeholders to create high-quality, scalable applications. Key Responsibilities: Design, develop, and implement front-end and back-end applications. Write clean, efficient, and maintainable code in programming languages such as Python, Java, JavaScript, C#, or .NET. Participate in the entire software development lifecycle, including planning, coding, testing, and deployment. Collaborate with cross-functional teams using Agile methodologies. Develop APIs and integrate third-party services. Test and debug applications to ensure optimal performance and user experience. Use version control tools such as Git to manage code repositories. Perform software upgrades, maintenance, and support. Ensure solutions comply with Australian data privacy and security standards. Key Requirements: Bachelor’s degree in Computer Science, Software Engineering, or related field. 2-4 years of software development experience in Australia. Proficiency in programming languages (e.g., Java, Python, JavaScript, or C#). Experience with front-end frameworks (React, Angular, or Vue.js) and back-end tools (Node.js, Django, .NET Core). Strong understanding of relational databases (e.g., MySQL, PostgreSQL) and NoSQL databases (MongoDB). Familiarity with cloud platforms such as AWS, Azure, or GCP. Knowledge of containerisation tools (Docker, Kubernetes) is a plus. Ability to work in Agile environments and use tools like JIRA, Confluence, and Git. Competencies: Strong analytical and problem-solving skills. Excellent communication and team collaboration abilities. Ability to meet deadlines and deliver high-quality solutions. Continuous learning and passion for technology trends."
      }
    ]
}
